Masmiseim36/nxpSDK/devices/MKL81Z7/drivers/fsl_dryice.h
/*!
 * @brief DryIce Secure Key Registers.
 *
 * This provides constants to encode a mask for the DryIce Secure Key Registers.
 */
typedef enum _dryice_secure_key
{
    kDRYICE_NoSecureKey = 0U,      /*!< No Secure Key */
    kDRYICE_SecureKey0 = 1U << 0,  /*!< Secure Key Register 0 */
    kDRYICE_SecureKey1 = 1U << 1,  /*!< Secure Key Register 1 */
    kDRYICE_SecureKey2 = 1U << 2,  /*!< Secure Key Register 2 */
    kDRYICE_SecureKey3 = 1U << 3,  /*!< Secure Key Register 3 */
    kDRYICE_SecureKey4 = 1U << 4,  /*!< Secure Key Register 4 */
    kDRYICE_SecureKey5 = 1U << 5,  /*!< Secure Key Register 5 */
    kDRYICE_SecureKey6 = 1U << 6,  /*!< Secure Key Register 6 */
    kDRYICE_SecureKey7 = 1U << 7,  /*!< Secure Key Register 7 */
    kDRYICE_AllSecureKeys = 0xffU, /*!< Mask to select all DryIce Secure Key Registers */
} dryice_secure_key_t;

/*!
 * @brief DryIce Access Types.
 *
 * This provides constants to encode select between Read, Write and ReadWrite access types.
 */
typedef enum _dryice_readwrite
{
    kDRYICE_Read = 0U,
    kDRYICE_Write = 1U,
    kDRYICE_ReadWrite = 2U,
} dryice_readwrite_t;

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

#if defined(__cplusplus)
}
#endif

/*!
 * @brief Enables the clock gate for the DryIce.
 *
 * This function enables the clock gate for the DryIce peripheral.
 */
void DRYICE_Init(DRY_Type *base);

/*!
 * @brief Disables the clock the DryIce peripheral.
 *
 * This function disables glitch filters and active tampers
 * This function disables the DryIce clock and prescaler in DryIce Control Register.
 * This function disables the clock gate for the DryIce peripheral.
 */
void DRYICE_Deinit(DRY_Type *base);

/*!
 * @brief Gets default values for the DryIce Control Register.
 *
 * This function fills the given structure with default values for the DryIce Control Register.
 * The default values are:
 * @code
 *     defaultConfig->innerClockAndPrescalerEnable = true
 *     defaultConfig->tamperForceSystemResetEnable = false
 *     defaultConfig->updateMode = kDRYICE_StatusLockWithTamper
 *     defaultConfig->clockSourceActiveTamper0 = kDRYICE_ClockType1Hz
 *     defaultConfig->clockSourceActiveTamper1 = kDRYICE_ClockType1Hz
 *     defaultConfig->tamperHysteresisSelect = kDRYICE_Hysteresis305mV
 *     defaultConfig->tamperPassiveFilterEnable = false
 *     defaultConfig->tamperDriveStrength = kDRYICE_DriveStrengthLow
 *     defaultConfig->tamperSlewRate = kDRYICE_SlewRateSlow
 *     defaultConfig->secureRegisterFile = kDRYICE_VbatRegisterResetWithTamperOrInterrupt
 *     defaultConfig->prescaler = 0
 * @endcode
 * @param base DryIce peripheral base address
 * @param[out] defaultConfig Pointer to structure to be filled with default parameters
 */
void DRYICE_GetDefaultConfig(DRY_Type *base, dryice_config_t *defaultConfig);

/*!
 * @brief Writes to the DryIce Control Register.
 *
 * This function writes the given structure to the DryIce Control Register.
 * @param base DryIce peripheral base address
 * @param config Pointer to structure with DryIce peripheral configuration parameters
 * @return kStatus_Fail when writing to DryIce Control Register is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t DRYICE_SetConfig(DRY_Type *base, const dryice_config_t *config);

/*!
 * @brief Software reset.
 *
 * This function resets all DryIce registers except WAC, RAC, SRAC, and SWAC. The CR[SWR] field is also not affected;
 * it is reset by VBAT POR only.
 *
 * @param base DryIce peripheral base address
 * @return kStatus_Fail when writing to DryIce Control Register is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t DRYICE_SoftwareReset(DRY_Type *base);

/*!
 * @brief Writes to the active tamper register(s).
 *
 * This function writes per active tamper register parameters to active tamper register(s).
 *
 * @param base DryIce peripheral base address
 * @param activeTamperConfig Pointer to structure with active tamper register parameters
 * @param activeTamperRegisterSelect Bit mask for active tamper registers to be configured. The passed value is
 *                                   combination of dryice_active_tamper_register_t values (OR'ed).
 * @return kStatus_Fail when writing to DryIce Active Tamper Register(s) is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t DRYICE_ActiveTamperSetConfig(DRY_Type *base,
                                      const dryice_active_tamper_config_t *activeTamperConfig,
                                      uint32_t activeTamperRegisterSelect);

/*!
 * @brief Gets default values for tamper pin configuration.
 *
 * This function fills the give structure with default values for the tamper pin and glitch filter configuration.
 * The default values are:
 * @code
 *     pinConfig->pinDirection = kDRYICE_TamperPinDirectionIn;
 *     pinConfig->pinPolarity = kDRYICE_TamperPinPolarityExpectNormal;
 *     pinConfig->glitchFilterWidth = 0;
 *     pinConfig->glitchFilterPrescaler = kDRYICE_GlitchFilterClock512Hz;
 *     pinConfig->glitchFilterEnable = false;
 *     pinConfig->tamperPinSampleWidth = kDRYICE_GlitchFilterSampleDisable;
 *     pinConfig->tamperPinSampleFrequency = kDRYICE_GlitchFilterSamplingEveryCycle8;
 *     pinConfig->tamperPinExpected = kDRYICE_GlitchFilterExpectedLogicZero;
 *     pinConfig->tamperPullEnable = false;
 *     pinConfig->tamperPullSelect = kDRYICE_GlitchFilterPullTypeAssert;
 * @endcode
 *
 * @param base DryIce peripheral base address
 * @param[out] pinConfig Pointer to structure to be filled with tamper pins default parameters
 */
void DRYICE_PinGetDefaultConfig(DRY_Type *base, dryice_pin_config_t *pinConfig);

/*!
 * @brief Writes the tamper pin configuration.
 *
 * This function writes per pin parameters to tamper pin and glitch filter configuration registers.
 *
 * @param base DryIce peripheral base address
 * @param pinConfig Pointer to structure with tamper pin and glitch filter configuration parameters
 * @param pinSelect Bit mask for tamper pins to be configured. The passed value is combination of
 *                  enum _dryice_tamper_pin (dryice_tamper_pin_t) values (OR'ed).
 * @return kStatus_Fail when writing to DryIce Pin Direction, Pin Polarity or Glitch Filter Register(s) is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t DRYICE_PinSetConfig(DRY_Type *base, const dryice_pin_config_t *pinConfig, uint32_t pinSelect);

/*!
 * @brief Reads the Secure Key Register(s).
 *
 * This function reads actual value from Secure Key Register(s).
 *
 * @param base DryIce peripheral base address
 * @param[out] key Pointer to storage array (application buffer)
 * @param keySize Storage array size in bytes
 * @return kStatus_Fail if reading is not allowed (read access disabled or key argument is NULL)
 * @return kStatus_Success when secure keys have been written to input storage array
 */
status_t DRYICE_GetKey(DRY_Type *base, uint8_t *key, size_t keySize);

/*!
 * @brief Writes the Secure Key Register(s).
 *
 * This function writes given data to Secure Key Register(s).
 *
 * @param base DryIce peripheral base address
 * @param key Pointer to key to be stored in the DryIce peripheral
 * @param keySize Key size in bytes
 * @return kStatus_Fail if writing is not allowed (locked or write access disabled or key argument is NULL)
 * @return kStatus_Success when Secure Key Register(s) have been written with new values
 */
status_t DRYICE_WriteKey(DRY_Type *base, const uint8_t *key, size_t keySize);

/*!
 * @brief Reads the Status Register.
 *
 * This function reads flag bits from DryIce Status Register.
 *
 * @param base DryIce peripheral base address
 * @param[out] result Pointer to uint32_t where to write Status Register read value. Use dryice_status_flag_t to decode
 *                    individual flags.
 * @return kStatus_Fail when Status Register reading is not allowed
 * @return kStatus_Success when result is written with the Status Register read value
 */
status_t DRYICE_GetStatusFlags(DRY_Type *base, uint32_t *result);

/*!
 * @brief Writes to the Status Register.
 *
 * This function clears specified flag bits in DryIce Status Register.
 *
 * @param base DryIce peripheral base address
 * @param mask Bit mask for the flag bits to be cleared. Use dryice_status_flag_t to encode flags.
 * @return kStatus_Fail when Status Register writing is not allowed
 * @return kStatus_Success when mask is written to the Status Register
 */
status_t DRYICE_ClearStatusFlags(DRY_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Interrupt Enable Register.
 *
 * This function sets specified interrupt enable bits in DryIce Interrupt Enable Register.
 *
 * @param base DryIce peripheral base address
 * @param mask Bit mask for the interrupt enable bits to be set.
 * @return kStatus_Fail when Interrupt Enable Register writing is not allowed
 * @return kStatus_Success when mask is written to the Interrupt Enable Register
 */
status_t DRYICE_EnableInterrupts(DRY_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Interrupt Enable Register.
 *
 * This function clears specified interrupt enable bits in DryIce Interrupt Enable Register.
 *
 * @param base DryIce peripheral base address
 * @param mask Bit mask for the interrupt enable bits to be cleared.
 * @return kStatus_Fail when Interrupt Enable Register writing is not allowed
 * @return kStatus_Success when specified bits are cleared in the Interrupt Enable Register
 */
status_t DRYICE_DisableInterrupts(DRY_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Tamper Enable Register.
 *
 * This function sets specified tamper enable bits in DryIce Tamper Enable Register.
 *
 * @param base DryIce peripheral base address
 * @param mask Bit mask for the tamper enable bits to be set.
 * @return kStatus_Fail when Tamper Enable Register writing is not allowed
 * @return kStatus_Success when mask is written to the Tamper Enable Register
 */
status_t DRYICE_EnableTampers(DRY_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Tamper Enable Register.
 *
 * This function clears specified tamper enable bits in DryIce Tamper Enable Register.
 *
 * @param base DryIce peripheral base address
 * @param mask Bit mask for the tamper enable bits to be cleared.
 * @return kStatus_Fail when Tamper Enable Register writing is not allowed
 * @return kStatus_Success when specified bits are cleared in the Tamper Enable Register
 */
status_t DRYICE_DisableTampers(DRY_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Tamper Seconds Register.
 *
 * This function writes to DryIce Tamper Seconds Register. This causes Status Register DTF flag to be set (DryIce
 * tampering detected).
 *
 * @param base DryIce peripheral base address
 * @return kStatus_Fail when Tamper Seconds Register writing is not allowed
 * @return kStatus_Success when Tamper Seconds Register is written
 */
status_t DRYICE_ForceTamper(DRY_Type *base);

/*!
 * @brief Reads the Tamper Seconds Register.
 *
 * This function reads DryIce Tamper Seconds Register. The read value returns the time in seconds at which the Status
 * Register DTF flag was set.
 *
 * @param base DryIce peripheral base address
 * @param tamperTimeSeconds Time in seconds at which the tamper detection SR[DTF] flag was set.
 * @return kStatus_Fail when Tamper Seconds Register reading is not allowed
 * @return kStatus_Success when Tamper Seconds Register is read
 */
status_t DRYICE_GetTamperTimeSeconds(DRY_Type *base, uint32_t *tamperTimeSeconds);

/*!
 * @brief Writes to the DryIce Lock Register.
 *
 * This function clears specified lock bits in the DryIce Lock Register.
 * When a lock bit is clear, a write to corresponding DryIce Register is ignored.
 * Once cleared, these bits can only be set by VBAT POR or software reset.
 *
 * @param base DryIce peripheral base address
 * @param mask Bit mask for the lock bits to be cleared. Use dryice_register_t values to encode (OR'ed) which DryIce
 * Registers shall be locked.
 */
void DRYICE_LockRegisters(DRY_Type *base, uint32_t mask);

/*!
 * @brief Writes to DryIce Secure Key Lock Registers.
 *
 * This function clears specified lock bits in the DryIce Secure Key Write or Secure Key Read Lock Registers.
 * When a lock bit is clear, a read/write from/to corresponding DryIce Secure Key Register is ignored.
 * Once cleared, these bits can only be set by VBAT POR or software reset.
 *
 * @param base DryIce peripheral base address
 * @param mask Bit mask for the lock bits to be cleared. Use dryice_secure_key_t values to encode (OR'ed) which DryIce
 *             Secure Key Registers shall be locked.
 * @param readWrite Select Read or Write (or ReadWrite) lock.
 */
void DRYICE_LockSecureKeys(DRY_Type *base, uint32_t mask, dryice_readwrite_t readWrite);

/*!
 * @brief Writes to DryIce Access Control Registers.
 *
 * This function clears specified access control bits in the DryIce Access Control Registers.
 * When an access control bit is clear, a read/write from/to corresponding DryIce Register or Secure Key Register is
 * ignored.
 * Once cleared, these bits can only be set by VBAT POR or software reset.
 *
 * @param base DryIce peripheral base address
 * @param maskRegisters Bit mask for the access control bits to be cleared. Use dryice_register_t values to encode
 *                      (OR'ed) which DryIce Registers shall be access controlled.
 * @param maskKeys Bit mask for the access control bits to be cleared. Use dryice_secure_key_t values to encode (OR'ed)
 *                 which DryIce Secure Key Registers shall be access controlled.
 * @param readWrite Disallow Read or Write (or ReadWrite).
 */
void DRYICE_DisableAccess(DRY_Type *base, uint32_t maskRegisters, uint32_t maskKeys, dryice_readwrite_t readWrite);

/*!
 *@}
 */

#endif /* _FSL_DRYICE_H_ */
